# Найдите сумму цифр трехзначного числа (123 = 1 + 2 + 3)

num = int(input("Введите число: "))

n = num // 100
m = num // 10 % 10
k = num % 10

print(n + m + k)
print(n, "+", m, "+", k)